src/CF/Catalogs/СертификатыГигиеническиеЗаключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>СертификатыГигиеническиеЗаключения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресОрганизацииЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХраненияНаДиске</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументаСертификатаИлиГигиеническогоЗаключения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтрактаОПоствкеПредметаЭкспертизыВУкраину</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаТеритории</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентЗаявительЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОрганизацииЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаДоговораОпределяющегоПериодДействияЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаПротоколаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействительностиДанногоЗаключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыТорговойМаркиПредметаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефоныОрганизацииЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяМаркаПредметаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОРуководителяЭкспертногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОУтверждающегоОрганизацииЭкспертизы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоДополненийКЭкспертизе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоИзображенийСканов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоСтрокСостава</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСертификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУКТВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеИзДокументаЭкспертизы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изображения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресИзображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОриентацияЛандшафт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзображениеИзБазыДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Изображения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендуемыйМинимальныйОстатокТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланкаКоличестваДляЛьготнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтслеживатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьУказаниеБезСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/СертификатыГигиеническиеЗаключения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// sza140420-0420  
// sza140228-0421  
// sza111031-1500 
&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	ФормироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиПриИзменении(Элемент)
	
	ФормироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияВидИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТипВладельца", ДопИнфоТипВладельца);
	ФормаВыбораВидаИнформации = ПолучитьФорму("Справочник.ДополнительныеРеквизиты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	ВидИнформации = ФормаВыбораВидаИнформации.ОткрытьМодально();
	Если ЗначениеЗаполнено(ВидИнформации) Тогда
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.ВидИнформации = ВидИнформации;
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.Информация = ОбщийМодульКлиент.ПолучитьЗначениеПоУмолчаниюПоляДополнительнойИнформации(ВидИнформации);
		СтандартнаяОбработка = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент)
	ДопИнформацияИзменена = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	
	ФормироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ значениезаполнено(Объект.ДатаОкончанияДействия) Тогда
		сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указана дата окончания действия!"));
		отказ = ИСТИНА;
	КонецЕсли;
	
	Если НЕ значениезаполнено(Объект.ВидДокумента) Тогда
		сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указан вид документа!"));
		отказ = ИСТИНА;
	КонецЕсли;
	
	Если НЕ значениезаполнено(Объект.НомерДокумента) Тогда
		сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указан номер документа!"));
		отказ = ИСТИНА;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ФормироватьНаименование();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлюсГод(Команда)
	
	Если значениезаполнено(Объект.ДатаОкончанияДействия) Тогда
		Объект.ДатаОкончанияДействия = Объект.ДатаОкончанияДействия + 3600 * 24 * 365.259636;
	Иначе
		Объект.ДатаОкончанияДействия = текущаядата() + 3600 * 24 * 365.259636;
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоГруппеНоменклатуры(Команда)
	
	Формавыборгруппы = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаВыбораГруппы");
	ГруппаН = формавыборгруппы.ОткрытьМодально();
	Если ЗначениеЗаполнено(ГруппаН) Тогда
		ПоГруппеНоменклатурыС(ГруппаН);
	КонецЕсли;	                          
	
КонецПроцедуры

&НаСервере
Процедура ПоГруппеНоменклатурыС(ГруппаН)
	
	ОбъектН = ДанныеФормыВЗначение(Объект, тип("СправочникОбъект.СертификатыГигиеническиеЗаключения"));
	
	ЗапросГруппаН = Новый Запрос;
	ЗапросГруппаН.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаН)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ ";
	
	ЗапросГруппаН.УстановитьПараметр("ГруппаН", ГруппаН);
	
	ВыборГруппаН = ЗапросГруппаН.Выполнить();
	Если НЕ ВыборГруппаН.Пустой() Тогда
		РезГруппаН = ВыборГруппаН.Выбрать();
		
		Пока РезГруппаН.Следующий() Цикл
			
			Резсылка = РезГруппаН.Ссылка;
			Если ОбъектН.Товары.Найти(Резсылка, "Номенклатура") = Неопределено Тогда
				Строкасостава = ОбъектН.Товары.Добавить();
				Строкасостава.Номенклатура = Резсылка;
				Строкасостава.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В группе") + " " + ГруппаН;
			КонецЕсли;
			
		КонецЦикла;	// по результатам запроса ГруппаН
	КонецЕсли; // запрос ГруппаН 
	
	ЗначениеВДанныеФормы(ОбъектН, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПоНГС(ГруппаН)
	
	ОбъектН = ДанныеФормыВЗначение(Объект, тип("СправочникОбъект.СертификатыГигиеническиеЗаключения"));
	
	ЗапросГруппаН = Новый Запрос;
	ЗапросГруппаН.Текст = "ВЫБРАТЬ
	                      |	Номенклатура.Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.ЭтоГруппа = ЛОЖЬ
	                      |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	                      |	И Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа";
	
	ЗапросГруппаН.УстановитьПараметр("НоменклатурнаяГруппа", ГруппаН);
	
	ВыборГруппаН = ЗапросГруппаН.Выполнить();
	Если НЕ ВыборГруппаН.Пустой() Тогда
		РезГруппаН = ВыборГруппаН.Выбрать();
		
		Пока РезГруппаН.Следующий() Цикл
			
			Резсылка = РезГруппаН.Ссылка;
			Если ОбъектН.Товары.Найти(Резсылка, "Номенклатура") = Неопределено Тогда
				Строкасостава = ОбъектН.Товары.Добавить();
				Строкасостава.Номенклатура = Резсылка;
				Строкасостава.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В") + " " + ГруппаН;
			КонецЕсли;
			
		КонецЦикла;	// по результатам запроса ГруппаН
	КонецЕсли; // запрос ГруппаН 
	
	ЗначениеВДанныеФормы(ОбъектН, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоНоменклатурнойГруппе(Команда)
	
	Формавыборгруппы = ПолучитьФорму("Справочник.НоменклатурныеГруппы.ФормаВыбора");
	ГруппаН = формавыборгруппы.ОткрытьМодально();
	Если ЗначениеЗаполнено(ГруппаН) Тогда
		ПоНГС(ГруппаН);
	КонецЕсли;	                          
	
КонецПроцедуры

&НаСервере
Процедура ПоОПС(ГруппаН)
	
	ОбъектН = ДанныеФормыВЗначение(Объект, тип("СправочникОбъект.СертификатыГигиеническиеЗаключения"));
	
	ЗапросГруппаН = Новый Запрос;
	ЗапросГруппаН.Текст = "ВЫБРАТЬ
	                      |	Номенклатура.Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.ЭтоГруппа = ЛОЖЬ
	                      |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	                      |	И Номенклатура.Производитель = &Производитель";
	
	ЗапросГруппаН.УстановитьПараметр("Производитель", ГруппаН);
	
	ВыборГруппаН = ЗапросГруппаН.Выполнить();
	Если НЕ ВыборГруппаН.Пустой() Тогда
		РезГруппаН = ВыборГруппаН.Выбрать();
		
		Пока РезГруппаН.Следующий() Цикл
			
			Резсылка = РезГруппаН.Ссылка;
			Если ОбъектН.Товары.Найти(Резсылка, "Номенклатура") = Неопределено Тогда
				Строкасостава = ОбъектН.Товары.Добавить();
				Строкасостава.Номенклатура = Резсылка;
				Строкасостава.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("У поставщика") + ": " + ГруппаН;
			КонецЕсли;
			
		КонецЦикла;	// по результатам запроса ГруппаН
	КонецЕсли; // запрос ГруппаН 
	
	ЗначениеВДанныеФормы(ОбъектН, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоОсновномуПоставщику(Команда)
	
	Формавыборгруппы = ПолучитьФорму("Справочник.Производители.ФормаВыбора");
	ГруппаН = формавыборгруппы.ОткрытьМодально();
	Если ЗначениеЗаполнено(ГруппаН) Тогда
		ПоОПС(ГруппаН);
	КонецЕсли;	                          
	
КонецПроцедуры

&НаСервере
Процедура ПоПНС(ГруппаН)
	
	ОбъектН = ДанныеФормыВЗначение(Объект, тип("СправочникОбъект.СертификатыГигиеническиеЗаключения"));
	
	Для Каждого товар из ГруппаН.Товары цикл		
		
		Резсылка = товар.номенклатура;
		Если ОбъектН.Товары.Найти(Резсылка, "Номенклатура") = Неопределено Тогда
			Строкасостава = ОбъектН.Товары.Добавить();
			Строкасостава.Номенклатура = Резсылка;
			Строкасостава.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Из") + " " + ГруппаН;
		КонецЕсли;
		
	КонецЦикла;	// по результатам запроса ГруппаН
	
	ЗначениеВДанныеФормы(ОбъектН, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоПриходнойНакладной(Команда)
	
	Формавыборгруппы = ПолучитьФорму("Документ.ПоступленияТовара.ФормаВыбора");
	ГруппаН = формавыборгруппы.ОткрытьМодально();
	Если ЗначениеЗаполнено(ГруппаН) Тогда
		ПоПНС(ГруппаН);
	КонецЕсли;	                          
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	Если ДопИнформацияИзменена Тогда
		ОбщийМодульСервисСервер.ЗаписатьДополнительнуюИнформацию(Объект.Ссылка, ДополнительнаяИнформация);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000360", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОбъектСсылка = Объект.Ссылка;
		
		ДопИнфоТипВладельца = ОбщийМодульПовтор.ПолучитьТипВладельца(ОбъектСсылка); 	
		ОбщийМодульСервисСервер.ЗаполнитьДополнительнуюИнформацию(ОбъектСсылка, ДополнительнаяИнформация, ДопИнфоТипВладельца);
		
		Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		
		Объект.Активен = ИСТИНА;
		Объект.ДатаРегистрации = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
		Объект.Зарегистрировал = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
																	 КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьНаименование()
	
	Если НЕ ОбщийМодульПовтор.ЭтоГруппа(Объект) тогда
		
		Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
			Префикс = Объект.ВидДокумента.ПрефиксКНомеру;
		Иначе
			префикс = "";
		КонецЕсли;
		
		Правильноеимя = СокрЛП(Префикс + " " + Объект.НомерДокумента + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("от") + " " + формат(Объект.ДатаВыдачи, "ДФ=dd.MM.yy"));
		Если НЕ Объект.Наименование = Правильноеимя Тогда
			Объект.Наименование = Правильноеимя;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ФормироватьНаименование();
